_protected/frontend/controllers/SiteController.php

    protected function findModel($id)
    {
    	if (($model = CoursesModel::findOne($id)) !== null) {
---
SELECT EXISTS(SELECT * FROM `courses` WHERE (`id`='2'))
SELECT * FROM `courses` WHERE `id`='2'

    public function actionEnrollcourse(){
    	$userCourseModel = new CourseUser();
    	$courses = Utils::getCoursesList();
    	$userName = Utils::getStudentName(Yii::$app->user->id);
    	try{
    		if(isset($_GET['courseId']) && ($_GET['courseId']!="")){
    			$action = (isset($_GET['action']) && ($_GET['action']!="")) ? $_GET['action'] : "index";
    			$userCourseModel->course_id = $_GET['courseId'];
    			$userCourseModel->user_id = Yii::$app->user->id;
    			$userCourseModel->created_date = Utils::getCurrentDateTime();
    			if(\Yii::$app->request->post()){
    				if($userCourseModel->validate()){
    					if($userCourseModel->save()){
---
INSERT INTO `course_user` (`course_id`, `user_id`, `created_date`) VALUES (2, 2, '2017-03-21 10:27:25')

    public function actionDelistcourse(){
    	$userCourseModel = new CourseUser();
    	$courses = Utils::getCoursesList();
    	$userName = Utils::getStudentName(Yii::$app->user->id);
    	try{
    		if(isset($_GET['courseId']) && ($_GET['courseId']!="")){
    			$action = (isset($_GET['action']) && ($_GET['action']!="")) ? $_GET['action'] : "index";
    			$userCourseModel->course_id = $_GET['courseId'];
    			$userCourseModel->user_id = Yii::$app->user->id;
    			$userCourseModel->created_date = Utils::getCurrentDateTime();
    			if(\Yii::$app->request->post()){
    				if($userCourseModel->validate()){
    					$userCourse = $userCourseModel->findOne(['course_id'=>$userCourseModel->course_id,'user_id'=>$userCourseModel->user_id]);
    					if($userCourse->delete()){
---
SELECT EXISTS(SELECT * FROM `courses` WHERE (`id`='2'))
SELECT * FROM `course_user` WHERE (`course_id`='2') AND (`user_id`=2)
DELETE FROM `course_user` WHERE `id`=11