_protected/common/models/Students.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => Students::STATUS_ACTIVE]);
---
SELECT * FROM `students` WHERE (`username`='testuser1') AND (`status`=10)

    public static function userExists($username, $password, $scenario)
    {
        // if scenario is 'lwe', we need to check email, otherwise we check username
        $field = ($scenario === 'lwe') ? 'email' : 'username';

        if ($user = static::findOne([$field => $username]))
---
SELECT * FROM `students` WHERE `username`='testuser1'