_protected/common/models/StudentIdentity.php

SELECT * FROM `students` WHERE (`id`=2) AND (`status`=10)
---
    public static function findIdentity($id)
    {
    	return static::findOne(['id' => $id, 'status' => Students::STATUS_ACTIVE]);