_protected/common/models/UserIdentity.php

SELECT * FROM `user` WHERE (`id`=2) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => User::STATUS_ACTIVE]);