_protected/common/models/Utils.php

SELECT * FROM `user`
---
	public static function getAllUsers($status=NULL){
		$array = User::find()->all();

SELECT * FROM `students`
---
	public static function getAllStudents($status=NULL){
		$array = Students::find()->all();

SELECT * FROM `courses`
---
	public static function getCoursesList($status=""){
		if($status==1){
			$coursesArr = CoursesModel::findAll(['status'=>1]);
		} else {
			$coursesArr = CoursesModel::find()->all();

SELECT * FROM `platforms` WHERE `status`=1
SELECT * FROM `platforms`
---
	public static function getPlatformList($status=""){
		if($status==1){
			$platformsArr = Platforms::findAll(['status'=>1]);
		} else {
			$platformsArr = Platforms::find()->all();

SELECT * FROM `languages` WHERE `status`=1
SELECT * FROM `languages`
---
	public static function getLanguagesList($status=""){
		if($status==1){
			$arr = Languages::findAll(['status'=>1]);
		} else {
			$arr = Languages::find()->all();